Documents/ЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЧекККМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЭквайрингу</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСменыККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаВозврата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныВозвратаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСистемНалогообложенияККТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЧекаККМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЧековККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧекККМПродажа</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОплатЧекаККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭквайринговыйТерминал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылочныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЧекаЭТ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПлатежнойКарты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>24</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеПереданыВБанк</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыОплатЧекаККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОплатЧекаККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскийКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЧекККМ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// исключение проверки кассы если нет наличных оплат
	НайденныйВидОплаты = Оплата.НайтиСтроки(новый Структура("ВидОплаты", Перечисления.ВидыОплатЧекаККМ.Наличные));
	Если НайденныйВидОплаты.Количество() = 0 Тогда
		Если НЕ ПроверяемыеРеквизиты.Найти("Касса") = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Касса"));
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ (Константы.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Получить() И Константы.ИспользоватьУчетПоСтатьямДДС.Получить()) Тогда
		Если НЕ ПроверяемыеРеквизиты.Найти("Статья") = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Статья"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Товары.Количество() > 0 Тогда
		СуммаДокумента = Товары.Итог("Сумма");
	Иначе
		СуммаДокумента = Оплата.Итог("Сумма");
	КонецЕсли;
		
	СтатусЧекаККМПоСсылке = СтатусЧекаККМПоСсылке(Ссылка);
	
	Если ДополнительныеСвойства.Свойство("ПропуститьПроверкуПередЗаписью") Тогда
		Возврат;
	КонецЕсли;
	
	Если (СтатусЧекаККМПоСсылке = Перечисления.СтатусыЧековККМ.Пробитый
		ИЛИ СтатусЧекаККМПоСсылке = Перечисления.СтатусыЧековККМ.Архивный
	 	ИЛИ СтатусЧекаККМПоСсылке = Перечисления.СтатусыЧековККМ.Аннулированный) Тогда 
	
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Чек имеет статус ""%1"". Операции над этим документом запрещены!'"),
			СтатусЧекаККМ
		);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ЭтотОбъект,
			,
			,
			Отказ
		);
	
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ (СтатусЧекаККМ = Перечисления.СтатусыЧековККМ.Пробитый ИЛИ СтатусЧекаККМ = Перечисления.СтатусыЧековККМ.Архивный) Тогда
		Возврат;
	КонецЕсли;
	
	// проверка наличия товаров на складе должна происходить через РМК
	//списание со склада
	ДатаДвижения = Дата;
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	Если ДатаДвижения = Дата(1,1,1) Тогда
		ДатаДвижения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЭтоПродажа = (ВидОперации = Перечисления.ВидыОперацийЧекККМ.Продажа);
	
	// Себестоимость определяем если это возврат 
	ТаблицаСебестоимости = ПолучитьТаблицуСебестоимости(ЭтоПродажа);
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	
	Если ЭтоПродажа Тогда
		Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, ОрганизацияТоваров, Склад, Товары, ДатаДвижения);		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//++ №8793 товары нужно свернуть, чтобы корректно списать себестоимость
	мТовары = Товары.Выгрузить();
	мТовары.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Коэффициент", "Количество"); 
	//-- №8793
	
	Для Каждого Товар Из мТовары Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ?(ЭтоПродажа, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
		Движение.Период = ДатаДвижения;
		Движение.Организация = ОрганизацияТоваров;
		Движение.Склад = Склад;
		Движение.Номенклатура = Товар.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
		Движение.СерияНоменклатуры = Товар.СерияНоменклатуры;
		Количество = Товар.Количество * Товар.Коэффициент;
		Движение.Количество = Количество;
		Сумма    = 0;
		СуммаВал = 0;
		Если ЭтоПродажа Тогда
			//#8288
			//Сумма = Движение.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, Склад, Движение.Номенклатура, Движение.ХарактеристикаНоменклатуры, Движение.СерияНоменклатуры);
			СтруктураЦенОстатков = Движения.ТоварыНаСкладах.ПолучитьЦеныОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, Склад, Движение.Номенклатура, Движение.ХарактеристикаНоменклатуры, Движение.СерияНоменклатуры);
			Сумма = Движение.Количество * СтруктураЦенОстатков.Цена;
			СуммаВал = Движение.Количество * СтруктураЦенОстатков.ЦенаВал;
		Иначе
		// сумму возврата нужно получить по таблице себестоимости
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", 				 Товар.Номенклатура);
			Отбор.Вставить("ХарактеристикаНоменклатуры", Товар.ХарактеристикаНоменклатуры);
			Отбор.Вставить("СерияНоменклатуры", 		 Товар.СерияНоменклатуры);
						
			НайденныеСтроки = ТаблицаСебестоимости.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Сумма = Движение.Количество * НайденныеСтроки[0].Цена;
				СуммаВал = Движение.Количество * НайденныеСтроки[0].ЦенаВал;
			КонецЕсли;
		КонецЕсли;
		Движение.Сумма = ?(ЭтоПродажа, Сумма, -Сумма);
		Движение.СуммаВал = ?(ЭтоПродажа, СуммаВал, -СуммаВал);
	КонецЦикла;
	
	//продажи
	ВалютаУчета = ПолучитьФункциональнуюОпцию("ВалютаУчета");
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из Товары Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период 		= ДатаДвижения;
		Движение.Организация 	= Организация;
		Движение.Подразделение 	= Подразделение;
		Движение.Склад 			= Склад; //#12367
		Движение.Контрагент 	= Контрагент;
		//Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.ДокументПродажи = Ссылка;		
		Движение.Номенклатура 				= ТекущаяСтрока.Номенклатура;
		Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
		Движение.СерияНоменклатуры 			= ТекущаяСтрока.СерияНоменклатуры;		
		
		Движение.ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;         //#14300
		Движение.КоличествоВЕдиницахДокумента = ?(ЭтоПродажа, 1, -1) * ТекущаяСтрока.Количество;	//#14300
				
		Движение.Количество = ?(ЭтоПродажа, 1, -1) * ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
		Движение.Сумма    	= ?(ЭтоПродажа, 1, -1) * РаботаСВалютой.ПересчитатьИзВалютыВВалюту(Валюта, ВалютаУчета, ДатаДвижения, ТекущаяСтрока.Сумма);
		Движение.СуммаВал 	= ?(ЭтоПродажа, 1, -1) * РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);		
	КонецЦикла;
	
	ТаблицаОплат = Оплата.Выгрузить();
	ТаблицаОплат.Свернуть("ВидОплаты, ЭквайринговыйТерминал", "Сумма, СуммаКомиссии");
	
	// Наличная оплата
	НаличнаяОплата = ТаблицаОплат.НайтиСтроки(новый Структура("ВидОплаты", Перечисления.ВидыОплатЧекаККМ.Наличные));
	Если НаличнаяОплата.Количество() > 0 Тогда
	
		// регистр ДенежныеСредства Приход или Расход (Возврат)
		Движения.ДенежныеСредства.Записывать = Истина;
		Движение = Движения.ДенежныеСредства.Добавить();
		Движение.ВидДвижения = ?(ЭтоПродажа, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СчетКасса = Касса;
		Движение.Валюта = Валюта;
		Движение.Сумма = НаличнаяОплата[0].Сумма;
		
		// регистр ДвиженияДенежныеСредства Приход или Расход (Возврат)
		Если ЗначениеЗаполнено(Статья) И ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоСтатьямДДС") Тогда
			Движения.ДвиженияДенежныхСредств.Записывать = Истина;
			Движение = Движения.ДвиженияДенежныхСредств.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.СчетКасса = Касса;
			Если ЭтоПродажа Тогда
				Движение.СуммаПриход = НаличнаяОплата[0].Сумма;
			Иначе
				Движение.СуммаРасход = НаличнаяОплата[0].Сумма;
			КонецЕсли;	
			Движение.Статья = Статья;
			Движение.Валюта = Валюта;
		КонецЕсли;
		
	КонецЕсли;
	
	// Платежная карта
	ОплатаПлатежнойКартой = ТаблицаОплат.НайтиСтроки(новый Структура("ВидОплаты", Перечисления.ВидыОплатЧекаККМ.ПлатежнаяКарта));
	Если ОплатаПлатежнойКартой.Количество() > 0 Тогда
		
		// регистр РасчетыПоЭквайрингу Приход
		Движения.РасчетыПоЭквайрингу.Записывать = Истина;
		Движение = Движения.РасчетыПоЭквайрингу.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Если ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьРаспределениеПоЭквайрингу") Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ЭквайринговыйТерминал = ОплатаПлатежнойКартой[0].ЭквайринговыйТерминал;
		Если ПолучитьФункциональнуюОпцию("ИспользоватьРаспределениеПоЭквайрингу") Тогда
			Движение.Документ = Ссылка;
			Движение.ВидОперации = ОбщийМодульСервер.ВидОперацииПоЭквайрингуПоВидуОперацииЧека(ВидОперации);
		КонецЕсли;
		Движение.Сумма = ОплатаПлатежнойКартой[0].Сумма;
		Движение.КомиссияБанка = ОплатаПлатежнойКартой[0].СуммаКомиссии;
		
	КонецЕсли;	
	
	// регистр ДоходыРасходы
	Если ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов Тогда
		Если ПараметрыСеанса.ФинРезультатКассовыйМетодВеденияУчетаДоходовРасходов И НЕ СтатьяДоходов.Пустая() Тогда
			//кассовый метод
			Движения.ДоходыРасходы.Записывать = Истина;
			Движение = Движения.ДоходыРасходы.Добавить();
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.Подразделение 	= Подразделение;			
			Движение.Метод		 	= Перечисления.МетодыВеденияУчетаДоходовРасходов.Кассовый;
			Если ЭтоПродажа Тогда
				Движение.Статья 	  = СтатьяДоходов;
				Движение.СуммаДоходов = СуммаДокумента;
			Иначе
				Движение.СуммаРасходов = СуммаДокумента;
				Движение.Статья 	   = СтатьяРасходов;
			КонецЕсли;	
		КонецЕсли;	
	
		Если ПараметрыСеанса.ФинРезультатНеКассовыйМетодВеденияУчетаДоходовРасходов Тогда
			//некассовый метод			
			Метод = Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
			Движения.ДоходыРасходы.Записывать = Истина;
			Для Каждого ТекущаяСтрока Из Товары Цикл
				СтатьяПродажи = ?(НЕ ТекущаяСтрока.СтатьяДоходов.Пустая(), ТекущаяСтрока.СтатьяДоходов, СтатьяДоходов);
				СтатьяВозврата = ?(НЕ ТекущаяСтрока.СтатьяРасходов.Пустая(), ТекущаяСтрока.СтатьяРасходов, СтатьяРасходов);
				Если (ЭтоПродажа И СтатьяПродажи.Пустая())
					ИЛИ (НЕ ЭтоПродажа И СтатьяВозврата.Пустая())
					ИЛИ ТекущаяСтрока.Сумма = 0 Тогда
					Продолжить;
				КонецЕсли;			
				
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Подразделение 	= Подразделение;
				Движение.Метод		 	= Метод;
				Если ЭтоПродажа Тогда
					Движение.Статья = СтатьяПродажи;
					Движение.СуммаДоходов = ТекущаяСтрока.Сумма;
				Иначе
					Движение.Статья = СтатьяВозврата;
					Движение.СуммаРасходов = ТекущаяСтрока.Сумма;
				КонецЕсли;				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
		
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция ПолучитьТаблицуСебестоимости(ЭтоПродажа)
	
	Если ЭтоПродажа Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОбороты.Номенклатура,
	|	ТоварыНаСкладахОбороты.ХарактеристикаНоменклатуры,
	|	ТоварыНаСкладахОбороты.СерияНоменклатуры,
	|	ТоварыНаСкладахОбороты.Регистратор,
	|	ТоварыНаСкладахОбороты.КоличествоРасход КАК Количество,
	|	ТоварыНаСкладахОбороты.СуммаРасход КАК Сумма,
	|	ТоварыНаСкладахОбороты.СуммаВалРасход КАК СуммаВал,
	|	ВЫБОР
	|		КОГДА НЕ ТоварыНаСкладахОбороты.КоличествоРасход = 0
	|			ТОГДА ТоварыНаСкладахОбороты.СуммаРасход / ТоварыНаСкладахОбороты.КоличествоРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА НЕ ТоварыНаСкладахОбороты.КоличествоРасход = 0
	|			ТОГДА ТоварыНаСкладахОбороты.СуммаВалРасход / ТоварыНаСкладахОбороты.КоличествоРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЦенаВал
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(, , Регистратор, ) КАК ТоварыНаСкладахОбороты
	|ГДЕ
	|	ТоварыНаСкладахОбороты.Регистратор = &ДокументПродажи";
	
	Запрос.УстановитьПараметр("ДокументПродажи", ЧекККМПродажа);
	ТаблицаСебестоимости = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаСебестоимости;
		
КонецФункции

Функция СтатусЧекаККМПоСсылке(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЧекККМ.СтатусЧекаККМ
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат ВыБорка.СтатусЧекаККМ
	Иначе
		Возврат Перечисления.СтатусыЧековККМ.ПустаяСсылка()
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
